gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK_USER0xx.c
	i=id&0xff;//方案编号
	switch((id>>24)&0xf)//方案类型
	{
		case 1://普通采集方案
			i*=LENper_6014;
			i+=ADDR_6014_SDRAM;
			p8s=Get_Element((u8*)i,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;//0=无效,1=CSD在URATCtrl,其他值=透明抄读帧数据指针
			}
			i=UARTCtrl->RMCSDCount;//抄表CSD计数
			x=Get_DL698ByteTypeLenValue(p8s+1);//得到DL698字节类型长度单元的值
			UARTCtrl->RMCSDCountMax=x;//抄表CSD最大个数
			if(i>=x)
			{//抄表CSD计数>=数组数
				return 0;//0=无效,1=CSD在URATCtrl,其他值=透明抄读帧数据指针
			}
			p8s=Get_Element(p8s,i+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			LEN_CSD=Get_DL698DataLen(p8s,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LEN_CSD>>=8;
			if((LEN_CSD>sizeof(UARTCtrl->RMCSD))||(LEN_CSD<6))
			{
				return 0;
			}
			if(p8s[1]==0)//当抄表数据是OAD还是ROAD
			{//OAD
				UARTCtrl->RMOADROAD|=1;//抄表任务有抄过的OAD类型:b0=有OAD,b1=有ROAD,b3-b7保留;用于抄表数据存贮时是存在RAM还是NAND
			}
			else
			{//ROAD
				UARTCtrl->RMOADROAD|=2;//抄表任务有抄过的OAD类型:b0=有OAD,b1=有ROAD,b3-b7保留;用于抄表数据存贮时是存在RAM还是NAND
			}
			x=(UARTCtrl->RMCSD[2]<<8)|UARTCtrl->RMCSD[3];
			MR((u32)&UARTCtrl->RMCSD,(u32)p8s,LEN_CSD);
			n=(p8s[2]<<8)|p8s[3];
			switch(n)
			{
				case 0x5002://分钟冻结,采曲线数据,因会补抄上96点故用先用无效时间没相同文件名使已抄数为0,在RM_TxDATA.c中会每一点检查是否已抄
				case 0x5004://日冻结
				case 0x5006://月冻结
//					if(x!=n)
//					{//OI变化
//						NUMrm(PORTn);//抄表数;出口:任务需抄数，完成数，非法完成数,读记录文件中已完成的地址表
//						//重装,NUMrm(PORTn)会修改为0xff
//						MR((u32)&UARTCtrl->RMCSD,(u32)p8s,LEN_CSD);
//					}
					//交流采样通信口先冻结后抄表
					if(PORTn==ACSAMPLEPORT)//交流采样通信口号(虚拟)
					{
						CONGEAL_Record();//冻结
					}
					break;
			}
			
			x=UARTCtrl->RMprotocol;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			switch(x)
			{
				default://未知
					return 0;
				case 1://DL/T645-1997
					//曲线抄读
					if(UARTCtrl->RMCSD[1]==1)
					{//ROAD
						OAD=UARTCtrl->RMCSD[2+0]<<24;
						OAD|=UARTCtrl->RMCSD[2+1]<<16;
						OAD|=UARTCtrl->RMCSD[2+2]<<8;
						OAD|=UARTCtrl->RMCSD[2+3];
						if(OAD==0x50020200)
						{//分钟冻结
							i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
							if(i>=1)
							{
								return 0;
							}
								i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
								x=UARTCtrl->RMCSD[6];
								UARTCtrl->RMCSDSubCountMax=1;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
								UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
								if(i>=x)
								{//抄表CSD子计数>=数组数
									return 0;//抄完
								}
								OAD=(UARTCtrl->RMCSD[7+(4*i)+0]<<24)+(UARTCtrl->RMCSD[7+(4*i)+1]<<16)+(UARTCtrl->RMCSD[7+(4*i)+2]<<8)+(UARTCtrl->RMCSD[7+(4*i)+3]<<0);

								
								return 0;
						}
					}
				
					//先找全匹配
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i<NUMmax_601E)
					{//采集规则库中找到全匹配
						Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
						Len>>=8;
						p8d+=2+Len+4;
						//2007 主用DI
						x=p8d[1];//数组数
						x*=6;
						x+=2;
						p8d+=x;
						//2007 备用DI
						x=p8d[1];//数组数
						x*=6;
						x+=2;
						p8d+=x;
						p8d+=2;
						if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
						{//备用DI
							x=p8d[1];//数组数
							x*=4;
							x+=2;
							p8d+=x;
						}
						i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
						x=p8d[1];
						UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
						UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
						if(i>=x)
						{//抄表CSD子计数>=数组数
							return 0;
						}
						p8d+=4+(i*4);
						i=(p8d[0]<<8)|p8d[1];
						UARTCtrl->RM_DI=i;
						return (u8*)1;
					}
				//再找单个OAD匹配
					if(UARTCtrl->RMCSD[1]==0)//当前正在抄的CSD(有数据类型)
					{//不是ROAD错
						return 0;
					}
					i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
					x=UARTCtrl->RMCSD[6];//ROAD个数
					UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表ROAD计数>=数组数
						return 0;//抄完
					}
					OAD=(UARTCtrl->RMCSD[2]<<24)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[4]<<8)|UARTCtrl->RMCSD[5];
					i*=4;
					i+=7;
					ROAD=(UARTCtrl->RMCSD[i]<<24)|(UARTCtrl->RMCSD[i+1]<<16)|(UARTCtrl->RMCSD[i+2]<<8)|UARTCtrl->RMCSD[i+3];
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i>=NUMmax_601E)
					{
						return 0;
					}
					Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
					Len>>=8;
					p8d+=2+Len+4;
					//2007 主用DI
					x=p8d[1];//数组数
					x*=6;
					x+=2;
					p8d+=x;
					//2007 备用DI
					x=p8d[1];//数组数
					x*=6;
					x+=2;
					p8d+=x;
					p8d+=2;
					if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
					{//备用DI
						x=p8d[1];//数组数
						x*=4;
						x+=2;
						p8d+=x;
					}
					i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					x=p8d[1];
					UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表CSD子计数>=数组数
						return 0;
					}
					p8d+=4+(i*4);
					i=(p8d[0]<<8)|p8d[1];
					UARTCtrl->RM_DI=i;
					return (u8*)1;
				case 2://DL/T645-2007
//属性2∷=structure//删除时structure的数据单元清为0(NULL)
//{
//	数据列选择描述符  CSD，
//	规则描述  structrue
//	{
//		AcqCmd_2007  structure
//		{
//			主用DI  array octet-string(SIZE(4))，
//			备用DI  array octet-string(SIZE(4))
//		}，
//		AcqCmd_1997  structure
//		{
//			主用DI  array octet-string(SIZE(2))，
//			备用DI  array octet-string(SIZE(2))
//		}，
//		AcqCmd_Trans  structure
//		{
//			Frame  octet-string
//		}
//	}
//}
				//曲线抄读
					if(UARTCtrl->RMCSD[1]==1)
					{//ROAD
						OAD=UARTCtrl->RMCSD[2+0]<<24;
						OAD|=UARTCtrl->RMCSD[2+1]<<16;
						OAD|=UARTCtrl->RMCSD[2+2]<<8;
						OAD|=UARTCtrl->RMCSD[2+3];
						if(OAD==0x50020200)
						{//分钟冻结
							i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
							if(i>=1)
							{
								return 0;
							}
							id=UARTCtrl->TaskID;
							id=(id>>8)&0xff;//任务号
							i=UARTCtrl->MeterCount[id];//取档案号
							p8d=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
							p8d=Get_Element(p8d,2,8,0);//计算元素地址,使用ADDR_128KDATABUFF
							if(p8d==0)
							{
								return 0;
							}
							i=p8d[1];//取接线方式
							if(i==1)//未知（0），单相（1），三相三线（2），三相四线（3）
							{//单相
								i=UARTCtrl->RM_DI_TI_Count;//按时标间隔采集时的间隔计数
								if(i>=1)
								{//单相表曲线抄实时数据，只抄当前1个点
									return 0;//抄完
								}
								i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
								x=UARTCtrl->RMCSD[6];
								UARTCtrl->RMCSDSubCountMax=1;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
								UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
								if(i>=x)
								{//抄表CSD子计数>=数组数
									return 0;//抄完
								}
								OAD=(UARTCtrl->RMCSD[7+(4*i)+0]<<24)+(UARTCtrl->RMCSD[7+(4*i)+1]<<16)+(UARTCtrl->RMCSD[7+(4*i)+2]<<8)+(UARTCtrl->RMCSD[7+(4*i)+3]<<0);
								switch(OAD)
								{
									case 0x20210200://1 冻结时标
										return 0;
									case 0x00100201://2 正向有功总电能
										OAD=0x00010000;//DL645-2007标识 返回数据格式：XXXXXX.XX
										break;
									case 0x00200201://3 反向有功总电能  
										OAD=0x00020000;//DL645-2007标识 返回数据格式：XXXXXX.XX
										break;
									case 0x00300200://4 组合无功1电能
										OAD=0x0003ff00;//DL645-2007标识 返回数据格式：XXXXXX.XX(总及分费率)
										break;
									case 0x00400200://5 组合无功2电能
										OAD=0x0004ff00;//DL645-2007标识 返回数据格式：XXXXXX.XX(总及分费率)
										break;
									case 0x00500201://6 一象限无功总电能
										OAD=0x00050000;//DL645-2007标识 返回数据格式：XXXXXX.XX
										break;
									case 0x00600201://7 二象限无功总电能 返回数据格式：XXXXXX.XX
										OAD=0x00060000;//DL645-2007标识
										break;
									case 0x00700201://8 三象限无功总电能 返回数据格式：XXXXXX.XX
										OAD=0x00070000;//DL645-2007标识
										break;
									case 0x00800201://9 四象限无功总电能 返回数据格式：XXXXXX.XX
										OAD=0x00080000;//DL645-2007标识
										break;
									case 0x20170200://10 有功需量
						        OAD=0x02800004;//DL645-2007标识 返回数据格式：XX.XXXX
										break;
									case 0x20180200://11 无功需量
										OAD=0x02800005;//DL645-2007标识 返回数据格式：XX.XXXX
										break;
									case 0x20000200://12 电压
										OAD=0x0201ff00;//DL645-2007标识 返回数据格式：A相XXX.X B相XXX.X C相XXX.X
										break;										
									case 0x20000201://12 A相电压
										OAD=0x02010100;//DL645-2007标识 返回数据格式：A相XXX.X 
										break;
									case 0x20010200://13 电流
										OAD=0x0202ff00;//DL645-2007标识 返回数据格式：A相XXX.XXX B相XXX.XXX C相XXX.XXX
										break;										
									case 0x20010201://13 A相电流
										OAD=0x02020100;//DL645-2007标识 返回数据格式：A相XXX.XXX 
										break;
									case 0x20010400://14 零线电流
										OAD=0x02800001;//DL645-2007标识 返回数据格式：XXX.XXX
										break;
									case 0x20040200://15 有功功率
									case 0x20040202://15 A相有功功率
										OAD=0x0203ff00;//DL645-2007标识 返回数据格式：总XX.XXXX A相XX.XXXX B相XX.XXXX C相XX.XXXX
										break;
									case 0x20050200://16 无功功率
									case 0x20050202://16 A相无功功率
										OAD=0x0204ff00;//DL645-2007标识 返回数据格式：总XX.XXXX A相XX.XXXX B相XX.XXXX C相XX.XXXX
										break;
									case 0x200A0200://17 功率因数
									case 0x200A0202://17 A相功率因数
										OAD=0x0206ff00;//DL645-2007标识 返回数据格式：总X.XXX A相X.XXX B相X.XXX C相X.XXX
										break;
									case 0x11100201://18 冻结周期内正向有功最大需量 
										return 0;
									default:
										return 0;
								}
								UARTCtrl->RM_DI=OAD;
								return (u8*)1;
							}
							else
							{//三相
								UARTCtrl->RMCSDSubCountMax=1;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
								UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
								UARTCtrl->RM_DI=0x06000001;//全部6类负荷曲线
								return (u8*)1;
							}
						}
					}

				//先找全匹配
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i<NUMmax_601E)
					{//采集规则库中找到全匹配
						Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
						Len>>=8;
						p8d+=2+Len+4;
						if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
						{//备用DI
							x=p8d[1];//数组数
							x*=6;
							x+=2;
							p8d+=x;
						}
						i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
						x=p8d[1];
						UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
						UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
						if(i>=x)
						{//抄表CSD子计数>=数组数
							return 0;//抄完
						}
						p8d+=4+(i*6);
						i=(p8d[0]<<24)|(p8d[1]<<16)|(p8d[2]<<8)|p8d[3];
						UARTCtrl->RM_DI=i;
						return (u8*)1;
					}
				//再找单个OAD匹配
					if(UARTCtrl->RMCSD[1]==0)//当前正在抄的CSD(有数据类型)
					{//不是ROAD错
						return 0;
					}
					i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
					x=UARTCtrl->RMCSD[6];//ROAD个数
					UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表ROAD计数>=数组数
						return 0;//抄完
					}
					OAD=(UARTCtrl->RMCSD[2]<<24)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[4]<<8)|UARTCtrl->RMCSD[5];
					i*=4;
					i+=7;
					ROAD=(UARTCtrl->RMCSD[i]<<24)|(UARTCtrl->RMCSD[i+1]<<16)|(UARTCtrl->RMCSD[i+2]<<8)|UARTCtrl->RMCSD[i+3];
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i>=NUMmax_601E)
					{
						return 0;
					}
					Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
					Len>>=8;
					p8d+=2+Len+4;
					if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
					{//备用DI
						x=p8d[1];//数组数
						x*=6;
						x+=2;
						p8d+=x;
					}
					i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					x=p8d[1];
					UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表CSD子计数>=数组数
						return 0;//抄完
					}
					p8d+=4+(i*6);
					i=(p8d[0]<<24)|(p8d[1]<<16)|(p8d[2]<<8)|p8d[3];
					UARTCtrl->RM_DI=i;
					return (u8*)1;
					
				case 3://DL/T698.45
					x=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					if(x)
					{//子计数!=0
						return 0;
					}
					UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					UARTCtrl->RMCSDSubCountMax=0;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					return (u8*)1;
				case 4://CJ/T 188-2004
					
