gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK_USER0xx.c
					return 0;
			}
		case 2://事件采集方案
			i*=LENper_6016;
			i+=ADDR_6016_SDRAM;
			p8s=Get_Element((u8 *)i,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			i=p8s[3];//采集类型
			switch(i)
			{
				case 0://0	array ROAD	周期采集事件数据
					p8s+=4;
					break;
				case 1://1	NULL	根据通知采集所有事件数据
				case 2://2	array ROAD	根据通知采集指定事件数据
					return 0;
			}
			i=UARTCtrl->RMCSDCount;//抄表CSD计数
			x=Get_DL698ByteTypeLenValue(p8s+1);//得到DL698字节类型长度单元的值
			UARTCtrl->RMCSDCountMax=x;//抄表CSD最大个数
			if(i>=x)
			{//抄表CSD计数>=数组数
				return 0;
			}
			p8s=Get_Element(p8s,i+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			LEN_CSD=Get_DL698DataLen_S(p8s,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
			if(((LEN_CSD+1)>sizeof(UARTCtrl->RMCSD))||(LEN_CSD<6))
			{
				return 0;
			}
			//MR((u32)&UARTCtrl->RMCSD,(u32)p8s,LEN_CSD);
			//ROAD转为普通方案的RCSD格式，
			if(LEN_CSD)
			{
				LEN_CSD--;
			}
			UARTCtrl->RMCSD[0]=DataType_CSD;
			UARTCtrl->RMCSD[1]=1;
			MR(((u32)&UARTCtrl->RMCSD)+2,(u32)p8s+1,LEN_CSD);
		#if CompareMeterEventCount==1//全事件采集抄表是否比较发生次数:0=不比较(全部抄表数据写入文件),1=比较(只有次数变化的事件写入文件)
			RM_MeterEventAutoInc0x20220200(PORTn);//电能表事件抄读列选择若无发生次数(事件记录序号)则自动加入
		#endif
			x=UARTCtrl->RMprotocol;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			switch(x)
			{
				default://未知 
					return 0;
				case 1://DL/T645-1997
					return 0;
				case 2://DL/T645-2007
					OAD=(UARTCtrl->RMCSD[2]<<24)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[4]<<8)|UARTCtrl->RMCSD[5];
					i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					UARTCtrl->RMCSDSubCountMax=2;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					if(i>=2)
					{//抄表CSD子计数>=2
						return 0;
					}
					OAD=Get_Event645_DI(OAD,i);//获取当前的抄645表的数据项，OAD=事件OAD，index=当前OAD对应的第几个数据表示，从0开始，返回0=没有要抄读的数据标识
					if(OAD==0)
					{
						return 0;
					}
					UARTCtrl->RM_DI=OAD;
					UARTCtrl->RM_DI_N=0;
					return (u8*)1;
/*				
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i<NUMmax_601E)
					{//采集规则库中找到全匹配
						Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
						Len>>=8;
						p8d+=2+Len+4;
						if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
						{//备用DI
							x=p8d[1];//数组数
							x*=6;
							x+=2;
							p8d+=x;
						}
						i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
						x=p8d[1];
						UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
						if(i>=x)
						{//抄表CSD子计数>=数组数
							return 0;
						}
						p8d+=4+(i*6);
						i=(p8d[0]<<24)|(p8d[1]<<16)|(p8d[2]<<8)|p8d[3];
						UARTCtrl->RM_DI=i;
						return (u8*)1;
					}
				//再找单个OAD匹配
					if(UARTCtrl->RMCSD[1]==0)//当前正在抄的CSD(有数据类型)
					{//不是ROAD错
						return 0;
					}
					i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
					x=UARTCtrl->RMCSD[6];//ROAD个数
					UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表ROAD计数>=数组数
						return 0;//抄完
					}
					OAD=(UARTCtrl->RMCSD[2]<<24)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[4]<<8)|UARTCtrl->RMCSD[5];
					i*=4;
					i+=7;
					ROAD=(UARTCtrl->RMCSD[i]<<24)|(UARTCtrl->RMCSD[i+1]<<16)|(UARTCtrl->RMCSD[i+2]<<8)|UARTCtrl->RMCSD[i+3];
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i>=NUMmax_601E)
					{
						return 0;
					}
					Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
					Len>>=8;
					p8d+=2+Len+4;
					if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
					{//备用DI
						x=p8d[1];//数组数
						x*=6;
						x+=2;
						p8d+=x;
					}
					i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					x=p8d[1];
					UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表CSD子计数>=数组数
						return 0;//抄完
					}
					p8d+=4+(i*6);
					i=(p8d[0]<<24)|(p8d[1]<<16)|(p8d[2]<<8)|p8d[3];
					UARTCtrl->RM_DI=i;
					return (u8*)1;
*/	
				case 3://DL/T698.45
					x=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					if(x)
					{//子计数!=0
						return 0;
					}
					UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					UARTCtrl->RMCSDSubCountMax=0;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					return (u8*)1;
				case 4://CJ/T 188-2004
					
