gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK_USER0xx.c
					return 0;
			}
		case 3://透明方案
//属性2（透明方案）∷=structure//删除时structure的数据单元清为0(NULL)
//{
//	方案编号     unsigned，
//	方案内容集   array 方案内容，
//	方案内容∷=structure
//	{
//		通信地址        	TSA，
//		开始前脚本id   	long-unsigned，
//		完成后脚本id   	long-unsigned，
//		方案控制标志  	structure，
//		{
//			上报透明方案结果并等待后续报文  bool，
//			等待后续报文超时时间（秒）      long-unsigned，
//			结果比对标识    enum{不比对（0），比（1），比对上报（2）}，
//			结果比对参数    structure
//			{
//				特征字节      unsigned，
//				截取开始      long-unsigned，
//				截取长度      long-unsigned
//			}
//		}
//		方案报文集 	 	array 方案报文
//		方案报文∷=structure
//		{
//			报文序号  unsigned，
//			报文内容  octet-string
//		}
//	}
//	存储深度     long-unsigned
//}
			i*=LENper_6018;
			i+=ADDR_6018;
			MR(ADDR_DATABUFF,i,7);
			p8s=(u8*)ADDR_DATABUFF;
			if(p8s[0]!=DataType_structure)
			{
				return 0;
			}
			id>>=8;
			id&=0xff;
			x=Get_DL698ByteTypeLenValue(p8s+5);//得到DL698字节类型长度单元的值
			if(UARTCtrl->MeterCount[id]>=x)
			{
				return 0;
			}
			p8s=Get_Element((u8*)(i+4),UARTCtrl->MeterCount[id]+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			//方案报文集
			p8s=Get_Element(p8s,5,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			i=UARTCtrl->RMCSDCount;
			x=Get_DL698ByteTypeLenValue(p8s+1);//得到DL698字节类型长度单元的值
			UARTCtrl->RMCSDCountMax=x;//抄表CSD最大个数
			if(i>=x)
			{
				return 0;
			}
			p8s=Get_Element(p8s,UARTCtrl->RMCSDCount+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			return p8s+4;
		case 4://上报方案
		case 5://脚本方案
		default:
			return 0;
	}
}


#endif












